hpmicro/hpm_sdk/soc/HPM6700/ip/hpm_spi_regs.h
/*
 * CMDEN (RW)
 *
 * SPI command phase enable (Master mode only)
 * 0x0: Disable the command phase
 * 0x1: Enable the command phase
 */
#define SPI_TRANSCTRL_CMDEN_MASK (0x40000000UL)
#define SPI_TRANSCTRL_CMDEN_SHIFT (30U)
#define SPI_TRANSCTRL_CMDEN_SET(x) (((uint32_t)(x) << SPI_TRANSCTRL_CMDEN_SHIFT) & SPI_TRANSCTRL_CMDEN_MASK)
#define SPI_TRANSCTRL_CMDEN_GET(x) (((uint32_t)(x) & SPI_TRANSCTRL_CMDEN_MASK) >> SPI_TRANSCTRL_CMDEN_SHIFT)

/*
 * ADDREN (RW)
 *
 * SPI address phase enable (Master mode only)
 * 0x0: Disable the address phase
 * 0x1: Enable the address phase
 */
#define SPI_TRANSCTRL_ADDREN_MASK (0x20000000UL)
#define SPI_TRANSCTRL_ADDREN_SHIFT (29U)
#define SPI_TRANSCTRL_ADDREN_SET(x) (((uint32_t)(x) << SPI_TRANSCTRL_ADDREN_SHIFT) & SPI_TRANSCTRL_ADDREN_MASK)
#define SPI_TRANSCTRL_ADDREN_GET(x) (((uint32_t)(x) & SPI_TRANSCTRL_ADDREN_MASK) >> SPI_TRANSCTRL_ADDREN_SHIFT)

/*
 * ADDRFMT (RW)
 *
 * SPI address phase format (Master mode only)
 * 0x0: Address phase is the regular (single) mode
 * 0x1: The format of the address phase is the same as the data phase (DualQuad).
 */
#define SPI_TRANSCTRL_ADDRFMT_MASK (0x10000000UL)
#define SPI_TRANSCTRL_ADDRFMT_SHIFT (28U)
#define SPI_TRANSCTRL_ADDRFMT_SET(x) (((uint32_t)(x) << SPI_TRANSCTRL_ADDRFMT_SHIFT) & SPI_TRANSCTRL_ADDRFMT_MASK)
#define SPI_TRANSCTRL_ADDRFMT_GET(x) (((uint32_t)(x) & SPI_TRANSCTRL_ADDRFMT_MASK) >> SPI_TRANSCTRL_ADDRFMT_SHIFT)

/*
 * TRANSMODE (RW)
 *
 * Transfer mode
 * The transfer sequence could be
 * 0x0: Write and read at the same time
 * 0x1: Write only
 * 0x2: Read only
 * 0x3: Write, Read
 * 0x4: Read, Write
 * 0x5: Write, Dummy, Read
 * 0x6: Read, Dummy, Write
 * 0x7: None Data (must enable CmdEn or AddrEn in master mode)
 * 0x8: Dummy, Write
 * 0x9: Dummy, Read
 * 0xa~0xf: Reserved
 */
#define SPI_TRANSCTRL_TRANSMODE_MASK (0xF000000UL)
#define SPI_TRANSCTRL_TRANSMODE_SHIFT (24U)
#define SPI_TRANSCTRL_TRANSMODE_SET(x) (((uint32_t)(x) << SPI_TRANSCTRL_TRANSMODE_SHIFT) & SPI_TRANSCTRL_TRANSMODE_MASK)
#define SPI_TRANSCTRL_TRANSMODE_GET(x) (((uint32_t)(x) & SPI_TRANSCTRL_TRANSMODE_MASK) >> SPI_TRANSCTRL_TRANSMODE_SHIFT)

/*
 * DUALQUAD (RW)
 *
 * SPI data phase format
 * 0x0: Regular (Single) mode
 * 0x1: Dual I/O mode
 * 0x2: Quad I/O mode
 * 0x3: Reserved
 */
#define SPI_TRANSCTRL_DUALQUAD_MASK (0xC00000UL)
#define SPI_TRANSCTRL_DUALQUAD_SHIFT (22U)
#define SPI_TRANSCTRL_DUALQUAD_SET(x) (((uint32_t)(x) << SPI_TRANSCTRL_DUALQUAD_SHIFT) & SPI_TRANSCTRL_DUALQUAD_MASK)
#define SPI_TRANSCTRL_DUALQUAD_GET(x) (((uint32_t)(x) & SPI_TRANSCTRL_DUALQUAD_MASK) >> SPI_TRANSCTRL_DUALQUAD_SHIFT)

/*
 * TOKENEN (RW)
 *
 * Token transfer enable (Master mode only)
 * Append a one-byte special token following the address phase for SPI read transfers. The value of the special token should be selected in TokenValue.
 * 0x0: Disable the one-byte special token
 * 0x1: Enable the one-byte special token
 */
#define SPI_TRANSCTRL_TOKENEN_MASK (0x200000UL)
#define SPI_TRANSCTRL_TOKENEN_SHIFT (21U)
#define SPI_TRANSCTRL_TOKENEN_SET(x) (((uint32_t)(x) << SPI_TRANSCTRL_TOKENEN_SHIFT) & SPI_TRANSCTRL_TOKENEN_MASK)
#define SPI_TRANSCTRL_TOKENEN_GET(x) (((uint32_t)(x) & SPI_TRANSCTRL_TOKENEN_MASK) >> SPI_TRANSCTRL_TOKENEN_SHIFT)

/*
 * WRTRANCNT (RW)
 *
 * Transfer count for write data
 * WrTranCnt indicates the number of units of data to be transmitted to the SPI bus from the Data Register. The actual transfer count is (WrTranCnt+1).
 * WrTranCnt only takes effect when TransMode is 0, 1, 3, 4, 5, 6 or 8.
 * The size (bit-width) of a data unit is defined by the DataLen field of the Transfer Format Register.
 * For TransMode 0, WrTranCnt must be equal to RdTranCnt.
 */
#define SPI_TRANSCTRL_WRTRANCNT_MASK (0x1FF000UL)
#define SPI_TRANSCTRL_WRTRANCNT_SHIFT (12U)
#define SPI_TRANSCTRL_WRTRANCNT_SET(x) (((uint32_t)(x) << SPI_TRANSCTRL_WRTRANCNT_SHIFT) & SPI_TRANSCTRL_WRTRANCNT_MASK)
#define SPI_TRANSCTRL_WRTRANCNT_GET(x) (((uint32_t)(x) & SPI_TRANSCTRL_WRTRANCNT_MASK) >> SPI_TRANSCTRL_WRTRANCNT_SHIFT)

/*
 * TOKENVALUE (RW)
 *
 * Token value (Master mode only)
 * The value of the one-byte special token following the address phase for SPI read transfers.
 * 0x0: token value = 0x00
 * 0x1: token value = 0x69
 */
#define SPI_TRANSCTRL_TOKENVALUE_MASK (0x800U)
#define SPI_TRANSCTRL_TOKENVALUE_SHIFT (11U)
#define SPI_TRANSCTRL_TOKENVALUE_SET(x) (((uint32_t)(x) << SPI_TRANSCTRL_TOKENVALUE_SHIFT) & SPI_TRANSCTRL_TOKENVALUE_MASK)
#define SPI_TRANSCTRL_TOKENVALUE_GET(x) (((uint32_t)(x) & SPI_TRANSCTRL_TOKENVALUE_MASK) >> SPI_TRANSCTRL_TOKENVALUE_SHIFT)

/*
 * DUMMYCNT (RW)
 *
 * Dummy data count. The actual dummy count is (DummyCnt +1).
 * The number of dummy cycles on the SPI interface will be (DummyCnt+1)* ((DataLen+1)/SPI IO width)
 * The Data pins are put into the high impedance during the dummy data phase.
 * DummyCnt is only used for TransMode 5, 6, 8 and 9, which has dummy data phases.
 */
#define SPI_TRANSCTRL_DUMMYCNT_MASK (0x600U)
#define SPI_TRANSCTRL_DUMMYCNT_SHIFT (9U)
#define SPI_TRANSCTRL_DUMMYCNT_SET(x) (((uint32_t)(x) << SPI_TRANSCTRL_DUMMYCNT_SHIFT) & SPI_TRANSCTRL_DUMMYCNT_MASK)
#define SPI_TRANSCTRL_DUMMYCNT_GET(x) (((uint32_t)(x) & SPI_TRANSCTRL_DUMMYCNT_MASK) >> SPI_TRANSCTRL_DUMMYCNT_SHIFT)

/*
 * RDTRANCNT (RW)
 *
 * Transfer count for read data
 * RdTranCnt indicates the number of units of data to be received from SPI bus and stored to the Data Register. The actual received count is (RdTranCnt+1).
 * RdTransCnt only takes effect when TransMode is 0, 2, 3, 4, 5, 6 or 9.
 * The size (bit-width) of a data unit is defined by the DataLen field of the Transfer Format Register.
 * For TransMode 0, WrTranCnt must equal RdTranCnt.
 */
#define SPI_TRANSCTRL_RDTRANCNT_MASK (0x1FFU)
#define SPI_TRANSCTRL_RDTRANCNT_SHIFT (0U)
#define SPI_TRANSCTRL_RDTRANCNT_SET(x) (((uint32_t)(x) << SPI_TRANSCTRL_RDTRANCNT_SHIFT) & SPI_TRANSCTRL_RDTRANCNT_MASK)
#define SPI_TRANSCTRL_RDTRANCNT_GET(x) (((uint32_t)(x) & SPI_TRANSCTRL_RDTRANCNT_MASK) >> SPI_TRANSCTRL_RDTRANCNT_SHIFT)

/* Bitfield definition for register: CMD */
/*
 * CMD (RW)
 *
 * SPI Command
 */
#define SPI_CMD_CMD_MASK (0xFFU)
#define SPI_CMD_CMD_SHIFT (0U)
#define SPI_CMD_CMD_SET(x) (((uint32_t)(x) << SPI_CMD_CMD_SHIFT) & SPI_CMD_CMD_MASK)
#define SPI_CMD_CMD_GET(x) (((uint32_t)(x) & SPI_CMD_CMD_MASK) >> SPI_CMD_CMD_SHIFT)

/* Bitfield definition for register: ADDR */
/*
 * ADDR (RW)
 *
 * SPI Address
 * (Master mode only)
 */
#define SPI_ADDR_ADDR_MASK (0xFFFFFFFFUL)
#define SPI_ADDR_ADDR_SHIFT (0U)
#define SPI_ADDR_ADDR_SET(x) (((uint32_t)(x) << SPI_ADDR_ADDR_SHIFT) & SPI_ADDR_ADDR_MASK)
#define SPI_ADDR_ADDR_GET(x) (((uint32_t)(x) & SPI_ADDR_ADDR_MASK) >> SPI_ADDR_ADDR_SHIFT)

/* Bitfield definition for register: DATA */
/*
 * DATA (RW)
 *
 * Data to transmit or the received data
 * For writes, data is enqueued to the TX FIFO. The least significant byte is always transmitted first. If the TX FIFO is full and the SPIActive bit of the status register is 1, the ready signal hready/pready will be deasserted to insert wait states to the transfer.
 * For reads, data is read and dequeued from the RX FIFO. The least significant byte is the first received byte. If the RX FIFO is empty and the SPIActive bit of the status register is 1, the ready signal hready/pready will be deasserted to insert wait states to the transfer.
 * The FIFOs decouple the speed of the SPI transfers and the software鈥檚 generation/consumption of data. When the TX FIFO is empty, SPI transfers will hold until more data is written to the TX FIFO; when the RX FIFO is full, SPI transfers will hold until there is more room in the RX FIFO.
 * If more data is written to the TX FIFO than the write transfer count (WrTranCnt), the remaining data will stay in the TX FIFO for the next transfer or until the TX FIFO is reset.
 */
#define SPI_DATA_DATA_MASK (0xFFFFFFFFUL)
#define SPI_DATA_DATA_SHIFT (0U)
#define SPI_DATA_DATA_SET(x) (((uint32_t)(x) << SPI_DATA_DATA_SHIFT) & SPI_DATA_DATA_MASK)
#define SPI_DATA_DATA_GET(x) (((uint32_t)(x) & SPI_DATA_DATA_MASK) >> SPI_DATA_DATA_SHIFT)

/* Bitfield definition for register: CTRL */
/*
 * TXTHRES (RW)
 *
 * Transmit (TX) FIFO Threshold
 * The TXFIFOInt interrupt or DMA request would be issued to replenish the TX FIFO when the TX data count is less than or equal to the TX FIFO threshold.
 */
#define SPI_CTRL_TXTHRES_MASK (0xFF0000UL)
#define SPI_CTRL_TXTHRES_SHIFT (16U)
#define SPI_CTRL_TXTHRES_SET(x) (((uint32_t)(x) << SPI_CTRL_TXTHRES_SHIFT) & SPI_CTRL_TXTHRES_MASK)
#define SPI_CTRL_TXTHRES_GET(x) (((uint32_t)(x) & SPI_CTRL_TXTHRES_MASK) >> SPI_CTRL_TXTHRES_SHIFT)

